[
  {
    "id": "e3c4bf44-776e-4e96-b87a-655db70fe69d",
    "assignment_id": "d43ed9c9-3ab8-4e92-b73d-e97630249194",
    "student_id": "d69f3521-2f95-4279-bd06-2284b0323862",
    "class_id": "5f8d1198-5d85-4047-a1f3-5760910bbef9",
    "score": "6/10",
    "feedback": "a. Correct identification of Zone C for lowest dissolved oxygen. 1 point. b. Correct description of the inverse relationship between dissolved oxygen and biological oxygen demand. 1 point. c. Correct identification of Zone B for point-source pollution. 1 point. d. Incorrect identification of the dependent variable; student identified the independent variable instead. 0 points. e. Correct hypothesis regarding the relationship between dissolved oxygen levels and macroinvertebrate species. 1 point. f. Correct reasoning for selecting Zone A as the control. 1 point. g. Incomplete explanation; did not specify how cooler temperatures affect dissolved oxygen or species. 0 points. h. Incorrect explanation; raw sewage typically increases bacterial population due to nutrient availability. 0 points. i. Correct identification of sediment as an abiotic factor. 1 point. j. Incorrect explanation; did not address bioaccumulation or specific effects on higher trophic levels. 0 points.",
    "submission_text": "--- Page 1 ---\na. Zone C has the lowest level of dissolved oxygen.\nb. Dissolved oxygen and biological oxygen demand have an inverse relationship. When one is increased the other is decreased.\nc. Zone B is most likely when there is point-source water pollution.\nd. The independent variable in this experiment is the dissolved oxygen levels.\ne. An increase in dissolved oxygen levels will also lead to an increase in macroinvertebrate species.\nf. The researchers selected Zone A as the control because it is the zone before the point-source pollution is introduced.\ng. The cooler temps in winter months could alter the results of the investigation.\nh. The introduction of raw sewage decreases the amount of dissolved oxygen which is needed by the bacteria. Without the oxygen the bacteria can not break down organic matter and the population will decrease.\ni. Another abiotic factor that could influence the population size is the increase in sediments.\nj. Persistent organic pollutants can decrease or even wipe out populations on the lower trophic levels. Without the populations of the lower trophic levels, the higher trophic level populations will also decrease in population.",
    "graded_at": "2025-07-24T22:22:16.614891"
  },
  {
    "id": "e6757baa-6a42-435e-8a0d-d18849a45e9a",
    "assignment_id": "d43ed9c9-3ab8-4e92-b73d-e97630249194",
    "student_id": "41c7e525-4aec-4f25-8435-54b30a9b4324",
    "class_id": "5f8d1198-5d85-4047-a1f3-5760910bbef9",
    "score": "9/10",
    "feedback": "The student provided correct responses for most parts of the question. \n\n(a) Correctly identified Zone C as the zone with the lowest level of dissolved oxygen. \n(b) Correctly described the relationship between biological oxygen demand and dissolved oxygen. \n(c) Correctly identified Zone B as the likely point-source pollution zone. \n(d) Correctly identified the dependent variable as the number of macroinvertebrate species. \n(e) Provided a testable hypothesis, but it was incorrect as it stated the opposite relationship between dissolved oxygen and macroinvertebrate species. \n(f) Correctly described the reason for selecting Zone A as the control. \n(g) Correctly explained how winter data collection could alter results due to changes in dissolved oxygen. \n(h) Correctly described the effect of raw sewage on bacteria population. \n(i) Correctly identified sunlight as an abiotic factor influencing bacteria. \n(j) Correctly explained how persistent organic pollutants affect higher trophic levels through biomagnification. \n\nThe error in part (e) resulted in a deduction of one point.",
    "submission_text": "--- Page 1 ---\nImportant: Completely fill in the circle that corresponds to the question you are answering on this page.\n\nQuestion 1 ● Question 2 ○ Question 3 ○\n\nBegin your response to each question at the top of a new page. Do not skip lines.\n\na) The zone is zone C.\n\nb) As dissolved oxygen decreases, biological oxygen demand increases.\n\nc) The zone is zone B.\n\nd) The dependent variable is the number of macroinvertebrate species.\n\ne) If the level of dissolved oxygen decreases then there will be lesser (smaller) number of macroinvertebrate species in the zones.\n\nf) Zone A is the control because it is upstream of the point source meaning its dissolved oxygen levels are unaffected by the point source and it can therefore show regular levels of dissolved oxygen and macroinvertebrate species in the stream ecosystem.\n\ng) The modification could change the results because during summer months the water is hotter so it has less dissolved oxygen whereas during winter months the water is colder so it has more dissolved oxygen.\n\nUse a pen with black or dark blue ink only. Do NOT write your name. Do NOT write outside the box.\n\n--- Page 2 ---\nImportant: Completely fill in the circle that corresponds to the question you are answering on this page.\n\nQuestion 1\n\nQuestion 2\n\nQuestion 3\n\nBegin your response to each question at the top of a new page. Do not skip lines.\n\nh) The introduction of raw sewage increases the population of bacteria in the stream due to an increase in algae due to an algae bloom which is consumed and broken down by the bacteria.\n\ni) One abiotic factor is amount of sunlight available.\n\nj) Persistent organic pollutants (POPs) negatively affect higher trophic levels because the POPs can biomagnify meaning it increases in concentration as it goes up the trophic levels due to higher trophic level animals eating numerous smaller trophic level animals that have bioaccumulated the POPs.\n\nPage 3\n\nUse a pen with black or dark blue ink only. Do NOT write your name. Do NOT write outside the box.",
    "graded_at": "2025-07-24T22:22:20.618324"
  },
  {
    "id": "3d7db4f4-4e98-4f41-9687-b829070b03ff",
    "assignment_id": "d08f2801-7e3c-4cc8-9c50-a469aab16a52",
    "student_id": "41c7e525-4aec-4f25-8435-54b30a9b4324",
    "class_id": "5f8d1198-5d85-4047-a1f3-5760910bbef9",
    "score": "7/9",
    "feedback": "For part (a), the student correctly calculated the estimate of C'(5) using the difference quotient and provided the correct units, earning 2 points. For part (b), the student correctly set up the left Riemann sum and calculated the estimate, but did not interpret the integral as the average temperature, earning 2 out of 3 points. In part (c), the student correctly used the initial condition and calculated the temperature at t=20, earning 3 points. For part (d), the student correctly identified that C''(t) > 0 implies the temperature is changing at an increasing rate, earning 1 point. Overall, the student demonstrated a good understanding of the concepts but missed the interpretation aspect in part (b).",
    "submission_text": "--- Page 1 ---\n1 of 2\n\nSample 1A\n\nAnswer QUESTION 1 parts (a) and (b) on this page.\n\nt (minutes) | 0 | 3 | 7 | 12\nC(t) (degrees Celsius) | 100 | 85 | 69 | 55\n\nResponse for question 1(a)\n\nf(b) - f(a)\nb - a\n\nC'(5) = 69 - 85\n7 - 3 = -4 degrees Celsius per minute\n\nResponse for question 1(b)\n\n3(100) + 4(85) + 5(69) = 985 degrees Celsius\n\n1/12 ∫ from 0 to 12 C(t)dt is the average temperature over the interval from 0 min to 12 min\n\nPage 4\n\nUse a pencil or a pen with black or dark blue ink. Do NOT write your name. Do NOT write outside the box.\n\n--- Page 2 ---\n2 of 2\n\nSample 1A\n\nAnswer QUESTION 1 parts (c) and (d) on this page.\n\nResponse for question 1(c)\n\n55 + ∫₁₂²⁰ C'(t)dt = 40.32⁹ degrees Celsius\n\nResponse for question 1(d)\n\nThe temp of the coffee is changing at an increasing rate because C''(t) is + over the interval 12<t<20\n\nPage 5\n\nUse a pencil or a pen with black or dark blue ink. Do NOT write your name. Do NOT write outside the box.\n\n0068559\n\nC5829/5",
    "graded_at": "2025-07-25T21:31:20.217652"
  },
  {
    "id": "a93a3e5b-fed5-48ec-b520-352ca9745281",
    "assignment_id": "d08f2801-7e3c-4cc8-9c50-a469aab16a52",
    "student_id": "d69f3521-2f95-4279-bd06-2284b0323862",
    "class_id": "5f8d1198-5d85-4047-a1f3-5760910bbef9",
    "score": "5/9",
    "feedback": "For part (a), the student correctly estimated the derivative using the difference quotient, earning 1 point. However, they did not provide the correct units, missing the second point. In part (b), the student correctly set up the left Riemann sum and calculated the estimate, earning 2 points. They also correctly interpreted the result as the average temperature, earning the third point. For part (c), the student did not correctly use the initial condition or integrate to find the temperature at t=20, earning 0 points. In part (d), the student correctly identified that the second derivative is positive and concluded that the rate of change is increasing, earning 1 point. Overall, the student earned 5 out of 9 possible points.",
    "submission_text": "--- Page 1 ---\n1 of 2 Sample 1B\n\nAnswer QUESTION 1 parts (a) and (b) on this page.\n\nr (minutes) 0 3 7 12\nC(r) (degrees Celsius) 100 85 69 55\n\nResponse for question 1(a)\n\nf(b) - f(a) / b-a = 69 - 85 / 7 - 3 = -16 / 4 = -4\n\nMVT 7+3 / 2 = 10\n\nc'(5) ≈ -4 degrees C°/minute\n\nResponse for question 1(b)\n\n∫₀¹² c(t) dt\n≈ 3(100) + 4(85) + 5(69)\n≈ 985\n\n1/12 ∫₀¹² c(t) dt\n≈ 82.083333333 °C\n\nThis is the average temperature of the coffee from 0 to 12 minutes\n\nPage 4\n\nUse a pencil or a pen with black or dark blue ink. Do NOT write your name. Do NOT write outside the box.\n\n--- Page 2 ---\n2 of 2\n\nSample 1B\n\nAnswer QUESTION 1 parts (c) and (d) on this page.\n\nResponse for question 1(c)\n\nc'(t) = -24.55e^0.01t\n        100\n        24.55e^0.01t\n        100\n= -141.67081194\n\nResponse for question 1(d)\n\nc''(t) = 0.2455e^0.01t (100-t)\n                 100^2\nc''(16) = 0.2455e^0.01(16) (100-16)\n                 (16)^2\n= 0.0945318015\n\nIncreasing rate since c''(16) is positive and in the given interval.\n\nPage 5\n\nUse a pencil or a pen with black or dark blue ink. Do NOT write your name. Do NOT write outside the box.\n\n0116605",
    "graded_at": "2025-07-25T21:31:23.923524"
  }
]